Белгипрозем_2017/src/Documents/мПрейскурантЗИС/мПрейскурантЗИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мПрейскурантЗИС</name>
  <registerRecords>InformationRegister.мПрейскурантЗИС</registerRecords>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьУтвердившего</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>ЮрФизЛицо</name>
      <type>
        <types>EnumRef.ЮрФизЛицо</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.мСтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсвобождениеОтНДС</name>
      <type>
        <types>CatalogRef.мОсвобождениеОтНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/мПрейскурантЗИС/мПрейскурантЗИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мПрейскурантЗИС</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДолжностьУтвердившего</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Documents/мПрейскурантЗИС/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрейскурантЦены.ЮрФизЛицо КАК ЮрФизЛицо,
		|	ПрейскурантЦены.Стоимость КАК Стоимость,
		|	ПрейскурантЦены.Ссылка.ДолжностьУтвердившего КАК ДолжностьУтвердившего,
		|	ПрейскурантЦены.Ссылка.НачалоДействия КАК Период,
		|	ПрейскурантЦены.Цена,
		|	ПрейскурантЦены.СтавкаНДС,
		|	ПрейскурантЦены.ОсвобождениеОтНДС,
		|	ПрейскурантЦены.СуммаНДС
		|ИЗ
		|	Документ.мПрейскурантЗИС.Цены КАК ПрейскурантЦены
		|ГДЕ
		|	ПрейскурантЦены.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Результат = Запрос.Выполнить().Выгрузить();

	РегистрыСведений.мПрейскурантЗИС.ЗаписатьПрейскурант(Ссылка, Результат);
	
КонецПроцедуры
